Revit 2024 API
Floor.Create Method
Overload List
Name | Description
Create(Document, IList<CurveLoop>, ElementId, ElementId)
 Creates a new instance of architectural floor within the project.
Create(Document, IList<CurveLoop>, ElementId, ElementId, Boolean, Line, Double)
 Creates a new instance of floor within the project.
See Also
Floor Class
Floor Members
Autodesk.Revit.DB Namespace